{
    "packageName": "MCP Rule Server",
    "author": "kingpanther13",
    "version": "0.8.3",
    "minimumHEVersion": "2.3.0",
    "dateReleased": "2026-02-19",
    "documentationLink": "https://github.com/kingpanther13/Hubitat-local-MCP-server/blob/main/README.md",
    "communityLink": "",
    "releaseNotes": "v0.8.3 - Bug fixes: fix send_command parameter array handling (parameters arriving as JSON string were iterated character-by-character instead of parsed as array — caused setColor and other Map-parameter commands to crash on both real and virtual devices), fix get_hub_logs source filter (was checking timestamp field instead of message field — source searches never matched app/device names), add JSON string-to-Map parsing in rule action parameter converter (parity with parent app).\\n\\nv0.8.2 - Critical bug fixes: fix rule action execution crash (log.isDebugEnabled() not available in Hubitat sandbox — all rule actions were silently failing), fix send_command setColor/map-parameter handling (JSON string parameters now auto-parsed into Maps for commands like setColor that expect Map arguments).\\n\\nv0.8.1 - Bug fixes: remove dead code (toolEnableRule/toolDisableRule/toolToggleRule — unreachable since v0.8.0 merged into update_rule), fix stale tool references in toolListVirtualDevices message and get_tool_guide device_authorization section, fix TOOL_GUIDE.md gateway attribution for delete_app/delete_driver, update SKILL.md shared helpers table, flag BAT v1 test file as superseded, update BAT-v2 for final 9-gateway architecture.\n\nv0.8.0 - Category gateway proxy: consolidate 48 tools behind 9 domain-named gateways, reducing tools/list from 69 to 30. 21 core tools stay ungrouped (devices, rules, modes, HSM, update_device, virtual devices, get_hub_info, create_hub_backup, check_for_update, generate_bug_report, get_tool_guide). Merged get_hub_health and get_hub_details into get_hub_info with PII gating. Merged enable_rule/disable_rule into update_rule. Merged create/delete virtual device into manage_virtual_device. Dissolved manage_hub_info gateway. Each gateway shows tool summaries with parameter hints and returns full schemas on demand. Breaking change: proxied tools removed from tools/list but accessible via gateways.\n\nv0.7.7 - Code review round 2: MCP protocol fix (tool errors now use isError flag per spec), fix formatAge() singular grammar, short-circuit condition evaluation, fix CI workflow sed double-demotion bug, consolidate redundant getRooms()/getChildDevices() calls, replace eager describeAction() debug logging, deduplicate sunrise/sunset reschedule methods, fix variable_math double atomicState read, replace throwaway list in triggerMatchesDevice(), use Date reuse in substituteVariables(), replace JsonBuilder with recursive search for device references, estimate JSON size without serialization.\n\nv0.7.6 - Code review: fix hoursAgo calculation bug (was 10x off), fix variable shadowing of now() in rule conditions, centralize version via currentVersion() (eliminate 7 hardcoded version strings), extract shared helpers (buildRuleExport, toolInstallItem, toolDeleteItem, toolToggleRule, shouldRetryWithFreshCookie, clampPercent), reduce ~90 lines of duplicate code.\n\nv0.7.5 - Token efficiency: optimize tool descriptions using progressive disclosure pattern. Verbose descriptions (list_devices, create_rule, create_virtual_device, update_device, delete_device) trimmed to concise summaries with safety rules preserved. Detailed reference moved to get_tool_guide sections. Enhanced rules guide section with JSON syntax examples for all trigger types. ~27% reduction in tool description tokens.\n\nv0.7.4 - Stability fixes: configurable execution loop guard with push notifications (default 30/60s, adjustable in Settings), safe room move pattern (add-first), resilient multi-format date parsing.\n\nv0.7.3 - Documentation sync (SKILL.md section names now match actual source code structure).\n\nv0.7.2 - Device authorization safety + optimized tool descriptions + get_tool_guide (74 tools):\n\n- AI must CONFIRM before using non-exact device matches (prevents accidentally controlling HVAC, locks, etc.)\n- Exact device name matches can be used directly without confirmation\n- If no exact match, AI suggests similar devices and waits for user approval\n- Tool failures (e.g., create_virtual_device) must be reported, not worked around with existing devices\n- OPTIMIZED TOOL DESCRIPTIONS: ~387 lines reduced for better token efficiency (based on MCP best practices)\n- Critical safety rules preserved: pre-flight checklists, confirm requirements, backup requirements\n- NEW get_tool_guide TOOL: Embedded reference guide accessible via MCP for detailed guidance on device authorization, pre-flight checklists, virtual device types, rule structure, etc. Supports section-based retrieval to minimize token usage.\n\nv0.7.1 - Bug fixes and safety improvements:\n\n- AUTO-BACKUP for delete_rule: Rules are automatically backed up to File Manager before deletion\n- TEST RULE FLAG: Set testRule=true to mark rules that don't need backup on deletion\n- Bug fixes for time triggers, set_mode/set_hsm validation, button handlers\n\nv0.7.0 - Room management tools: list_rooms, get_room, create_room, delete_room, rename_room. Fix room assignment (use roomId field). 73 MCP tools total.\n\nv0.6.15 - Room assignment fix: API uses 'roomId' field not 'id' (discovered from API error response). Removes device from old room before adding to new room.\n\nv0.6.14 - Room assignment: POST /room/save with JSON content type, form-encoded, hub2/ prefix, Grails command object pattern.\n\nv0.6.13 - Room assignment: try PUT /room/<id> (Grails RESTful update), POST /room/save, POST /room/update, probe /room/list HTML for endpoint discovery. Adds verification via getRooms().\n\nv0.6.12 - Fix room assignment: use GET /room/addDevice with query params. POST returned 405 (Method Not Allowed), confirming it's a GET endpoint. Tries 7 GET param combinations + 3 POST fallbacks. Adds post-save verification via getRooms() to detect silent failures.\n\nv0.6.11 - Fix room assignment: use /room/ controller endpoints to add device to room. /device/save ignores roomId; rooms are managed from the room side.\n\nv0.6.10 - Fix room assignment: use fullJson device data for /device/save (Vue.js SPA has no HTML forms).\n\nv0.6.8 - Room assignment: capture 500 error response body for diagnosis\n\nv0.6.7 - Fix room assignment: add Grails version field for optimistic locking\n\nv0.6.6 - Room assignment: diagnostic build with device JSON dump\n\nv0.6.5 - Fix room assignment: use deviceTypeId field\n\n- The device JSON field is deviceTypeId, not typeId (was null, causing /device/save 500)\n\nv0.6.4 - Fix room assignment: extract device data from nested fullJson.device key\n\nv0.6.3 - Fix update_device room assignment (500) and enable/disable (404) bugs\n\n- Fix room assignment: use flat field names for /device/save (Grails convention, no device. prefix)\n- Fix enable/disable: use POST instead of GET for /device/disable endpoint\n- Add case-insensitive room name matching\n- Add comprehensive debug logging throughout update_device\n\nv0.6.2 - Add update_device tool (68 tools total)\n\n- New update_device: modify label, name, room, enable/disable, preferences, data values, and DNI on any accessible device\n- Room assignment via hub internal /device/save endpoint\n- Enable/disable via hub internal /device/disable endpoint\n- Label, name, DNI, data values, preferences via official Hubitat API\n\nv0.6.1 - Fix BigDecimal.round() crash in daily version update checker + sync rule app version\n\n- Fix checkForUpdate() crashing nightly at 3 AM due to BigDecimal.round(1) in Hubitat Groovy sandbox\n- Replace with pure integer math (compare milliseconds, cast to int for display)\n- Full audit of all division/rounding patterns across both apps — no other instances found\n- Sync hubitat-mcp-rule.groovy version from 0.4.7 to 0.6.1\n\nv0.6.0 - Virtual device creation and management:\n\n- New create_virtual_device: create virtual switches, buttons, sensors, and more as MCP-managed child devices\n- New list_virtual_devices: list all MCP-managed virtual devices with current states\n- New delete_virtual_device: remove MCP-managed virtual devices\n- Virtual devices are automatically accessible to all MCP device tools without manual selection\n- Supports 15 virtual device types (Switch, Button, Contact Sensor, Motion Sensor, etc.)\n- Virtual devices appear in Hubitat UI for sharing with Maker API, Dashboard, Rule Machine, etc.\n- 67 MCP tools total (up from 64 in v0.5.x)\n\nv0.5.4 - Fix BigDecimal arithmetic using pure integer math (device_health_check + delete_device)\n\nv0.5.3 - Fix BigDecimal.round() in device_health_check\n\nv0.5.2 - Fix device_health_check error handling\n\nv0.5.1 - Fix get_hub_logs JSON array parsing\n\nv0.5.0 - Monitoring tools and device management:\n\n- New get_hub_logs: access Hubitat built-in system logs with level/source filtering\n- New get_device_history: time-range event queries with attribute filtering via eventsSince()\n- New get_hub_performance: performance snapshots with CSV time-series trend tracking\n- New device_health_check: detect stale/offline devices across all selected devices\n- New delete_device: force-delete ghost/orphaned devices with comprehensive safeguards\n- 64 MCP tools total (up from 59 in v0.4.x)\n\nv0.4.8 - Fix Z-Wave/Zigbee endpoint compatibility for firmware 2.3.7.1+\nv0.4.7 - Comprehensive bug fixes from code review (10 fixes)\nv0.4.6 - Fix version mismatch bug in optimistic locking\nv0.4.5 - Smart large-file handling (chunked reading, resave mode, sourceFile mode)",
    "apps": [
        {
            "id": "a1b2c3d4-e5f6-7890-abcd-ef1234567890",
            "name": "MCP Rule Server",
            "namespace": "mcp",
            "location": "https://raw.githubusercontent.com/kingpanther13/Hubitat-local-MCP-server/main/hubitat-mcp-server.groovy",
            "required": true,
            "oauth": true,
            "primary": true
        },
        {
            "id": "b2c3d4e5-f6a7-8901-bcde-f23456789012",
            "name": "MCP Rule",
            "namespace": "mcp",
            "location": "https://raw.githubusercontent.com/kingpanther13/Hubitat-local-MCP-server/main/hubitat-mcp-rule.groovy",
            "required": true,
            "oauth": false,
            "primary": false
        }
    ],
    "drivers": []
}
